#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tnorlund/gh-actions-demo/runs/run-iSZU96ZbYqSoTSAJ

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
module.content_delivery.aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:681647709217:certificate/7f3d0563-0e75-4c88-974b-836b28005b26]
module.content_delivery.aws_route53_zone.zone: Refreshing state... [id=Z01748242C117ND6G1CV1]
module.identity.aws_iam_role.auth: Refreshing state... [id=auth_role]
module.identity.aws_api_gateway_rest_api.main: Refreshing state... [id=x8dkp13jl9]
module.api.aws_iam_role.lambda_role: Refreshing state... [id=api_blog_prod]
module.node_layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:3]
module.api.aws_iam_role.lambda_role_cognito: Refreshing state... [id=api_blog_cognito_prod]
module.content_delivery.aws_s3_bucket.root: Refreshing state... [id=tylernorlund.com]
module.identity.aws_ses_email_identity.identity: Refreshing state... [id=no-reply@tylernorlund.com]
module.analytics.aws_dynamodb_table.table: Refreshing state... [id=Blog]
module.analytics.aws_s3_bucket.bucket: Refreshing state... [id=tylernorlund-blog-analytics]
module.identity.aws_iam_role.user: Refreshing state... [id=user_role]
module.python_layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:us-east-1:681647709217:layer:analytics_python:3]
module.analytics.aws_iam_role.kinesis: Refreshing state... [id=kinesis_process_role]
module.identity.aws_iam_role.custom_message: Refreshing state... [id=custommessage]
module.analytics.aws_iam_role.kinesis_role: Refreshing state... [id=kinesis_role]
module.analytics.aws_iam_role.s3: Refreshing state... [id=s3_process_role]
module.identity.aws_iam_role.post_confirmation: Refreshing state... [id=post_confirmation_prod]
module.identity.aws_iam_role.unauth: Refreshing state... [id=unauth_role]
module.analytics.aws_cloudwatch_log_group.processor: Refreshing state... [id=/aws/lambda/firehose-lambda-processor]
module.content_delivery.aws_s3_bucket.www: Refreshing state... [id=www.tylernorlund.com]
module.analytics.aws_iam_role.lambda_role: Refreshing state... [id=iam_dynamo_stream]
module.analytics.aws_cloudwatch_log_group.stream: Refreshing state... [id=/aws/lambda/tylernorlund_blog_analytics]
module.analytics.aws_lambda_function.kinesis_processor: Refreshing state... [id=firehose-lambda-processor]
module.api.aws_api_gateway_resource.blog: Refreshing state... [id=k28zzg]
module.api.aws_api_gateway_resource.project: Refreshing state... [id=51mncr]
module.api.aws_api_gateway_resource.user: Refreshing state... [id=3xwvga]
module.api.aws_api_gateway_resource.user_details: Refreshing state... [id=ett2li]
module.analytics.aws_lambda_function.s3: Refreshing state... [id=s3-lambda-processor]
module.api.aws_api_gateway_resource.disable_user: Refreshing state... [id=ispxu3]
module.api.aws_api_gateway_resource.user_name: Refreshing state... [id=j49k9v]
module.identity.aws_lambda_function.custom_message: Refreshing state... [id=custom_message]
module.identity.aws_lambda_function.post_confirmation: Refreshing state... [id=post_confirmation]
module.analytics.aws_iam_role_policy.lambda_processor: Refreshing state... [id=kinesis_process_role:terraform-20210301202931891400000005]
module.analytics.aws_iam_role_policy.s3: Refreshing state... [id=s3_process_role:terraform-20210301202932129500000006]
module.api.module.post_disable_user.aws_lambda_function.lambda_function: Refreshing state... [id=post_disable_user]
module.api.module.post_blog.aws_lambda_function.lambda_function: Refreshing state... [id=post_blog]
module.api.module.delete_project.aws_lambda_function.lambda_function: Refreshing state... [id=delete_project]
module.api.module.get_user.aws_lambda_function.lambda_function: Refreshing state... [id=get_user]
module.api.module.post_user_name.aws_lambda_function.lambda_function: Refreshing state... [id=post_user_name]
module.api.module.get_project.aws_lambda_function.lambda_function: Refreshing state... [id=get_project]
module.api.module.post_project.aws_lambda_function.lambda_function: Refreshing state... [id=post_project]
module.api.module.get_user_details.aws_lambda_function.lambda_function: Refreshing state... [id=get_user_details]
module.analytics.aws_iam_role_policy.lambda_policy: Refreshing state... [id=iam_dynamo_stream:terraform-20210301202932331900000007]
module.analytics.aws_lambda_function.dynamo_db_stream: Refreshing state... [id=dynamodb-lambda-stream]
module.api.aws_iam_role_policy.lambda_policy: Refreshing state... [id=api_blog_prod:terraform-2021030120293757240000000c]
module.identity.aws_iam_role_policy.custom_message: Refreshing state... [id=custommessage:terraform-2021030120293753980000000b]
module.api.module.cors_reply.aws_api_gateway_method._: Refreshing state... [id=agm-x8dkp13jl9-k28zzg-OPTIONS]
module.api.module.post_blog.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-k28zzg-POST]
module.api.module.get_blog.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-k28zzg-GET]
module.api.module.post_project.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-51mncr-POST]
module.api.module.cors_project.aws_api_gateway_method._: Refreshing state... [id=agm-x8dkp13jl9-51mncr-OPTIONS]
module.api.module.get_project.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-51mncr-GET]
module.api.module.cors_user.aws_api_gateway_method._: Refreshing state... [id=agm-x8dkp13jl9-3xwvga-OPTIONS]
module.api.module.get_user.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-3xwvga-GET]
module.api.module.delete_project.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-51mncr-DELETE]
module.api.module.cors_user_details.aws_api_gateway_method._: Refreshing state... [id=agm-x8dkp13jl9-ett2li-OPTIONS]
module.api.module.get_user_details.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-ett2li-GET]
module.api.module.post_user_name.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-j49k9v-POST]
module.api.module.cors_user_name.aws_api_gateway_method._: Refreshing state... [id=agm-x8dkp13jl9-j49k9v-OPTIONS]
module.api.module.post_disable_user.aws_api_gateway_method.method: Refreshing state... [id=agm-x8dkp13jl9-ispxu3-POST]
module.api.module.get_blog.aws_lambda_function.lambda_function: Refreshing state... [id=get_blog]
module.api.module.cors_disable_user.aws_api_gateway_method._: Refreshing state... [id=agm-x8dkp13jl9-ispxu3-OPTIONS]
module.analytics.aws_lambda_permission.s3: Refreshing state... [id=terraform-20210301202936491900000008]
module.content_delivery.aws_cloudfront_distribution.root_distribution: Refreshing state... [id=E1034W8I5XPUEX]
module.analytics.aws_kinesis_firehose_delivery_stream.extended_s3_stream: Refreshing state... [id=arn:aws:firehose:us-east-1:681647709217:deliverystream/tylernorlund_blog_analytics]
module.api.module.post_blog.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.cors_reply.aws_api_gateway_integration._: Refreshing state... [id=agi-x8dkp13jl9-k28zzg-OPTIONS]
module.api.module.cors_reply.aws_api_gateway_method_response._: Refreshing state... [id=agmr-x8dkp13jl9-k28zzg-OPTIONS-200]
module.api.module.post_blog.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-k28zzg-POST]
module.api.module.post_project.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.cors_project.aws_api_gateway_integration._: Refreshing state... [id=agi-x8dkp13jl9-51mncr-OPTIONS]
module.api.module.post_project.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-51mncr-POST]
module.api.module.cors_project.aws_api_gateway_method_response._: Refreshing state... [id=agmr-x8dkp13jl9-51mncr-OPTIONS-200]
module.analytics.aws_lambda_event_source_mapping.dynamo_mapping: Refreshing state... [id=dfac6a80-eb28-49fa-a09c-4ee39afa198a]
module.api.module.get_project.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.get_project.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-51mncr-GET]
module.api.module.cors_user.aws_api_gateway_integration._: Refreshing state... [id=agi-x8dkp13jl9-3xwvga-OPTIONS]
module.api.module.cors_user.aws_api_gateway_method_response._: Refreshing state... [id=agmr-x8dkp13jl9-3xwvga-OPTIONS-200]
module.api.module.cors_user_details.aws_api_gateway_integration._: Refreshing state... [id=agi-x8dkp13jl9-ett2li-OPTIONS]
module.api.module.get_user.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.delete_project.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.delete_project.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-51mncr-DELETE]
module.api.module.cors_user_details.aws_api_gateway_method_response._: Refreshing state... [id=agmr-x8dkp13jl9-ett2li-OPTIONS-200]
module.api.module.get_user.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-3xwvga-GET]
module.api.module.get_user_details.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-ett2li-GET]
module.api.module.get_user_details.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.cors_user_name.aws_api_gateway_integration._: Refreshing state... [id=agi-x8dkp13jl9-j49k9v-OPTIONS]
module.api.module.cors_user_name.aws_api_gateway_method_response._: Refreshing state... [id=agmr-x8dkp13jl9-j49k9v-OPTIONS-200]
module.analytics.aws_iam_role_policy.kinesis_stream: Refreshing state... [id=kinesis_role:terraform-20210301202937219400000009]
module.api.module.post_user_name.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.post_user_name.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-j49k9v-POST]
module.api.module.post_disable_user.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.module.cors_disable_user.aws_api_gateway_method_response._: Refreshing state... [id=agmr-x8dkp13jl9-ispxu3-OPTIONS-200]
module.api.module.cors_disable_user.aws_api_gateway_integration._: Refreshing state... [id=agi-x8dkp13jl9-ispxu3-OPTIONS]
module.api.module.post_disable_user.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-ispxu3-POST]
module.analytics.aws_s3_bucket_notification.bucket_terraform_notification: Refreshing state... [id=tylernorlund-blog-analytics]
module.api.module.cors_reply.aws_api_gateway_integration_response._: Refreshing state... [id=agir-x8dkp13jl9-k28zzg-OPTIONS-200]
module.api.module.get_blog.aws_lambda_permission.permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.content_delivery.aws_cloudfront_distribution.www_distribution: Refreshing state... [id=EHZQI7ZO32PE6]
module.api.module.get_blog.aws_api_gateway_integration.integration: Refreshing state... [id=agi-x8dkp13jl9-k28zzg-GET]
module.api.module.cors_project.aws_api_gateway_integration_response._: Refreshing state... [id=agir-x8dkp13jl9-51mncr-OPTIONS-200]
module.analytics.aws_lambda_permission.blog: Refreshing state... [id=terraform-2021030120301304250000000d]
module.api.module.cors_user.aws_api_gateway_integration_response._: Refreshing state... [id=agir-x8dkp13jl9-3xwvga-OPTIONS-200]
module.content_delivery.aws_route53_record.root: Refreshing state... [id=Z01748242C117ND6G1CV1__A]
module.api.module.cors_user_details.aws_api_gateway_integration_response._: Refreshing state... [id=agir-x8dkp13jl9-ett2li-OPTIONS-200]
module.api.module.cors_user_name.aws_api_gateway_integration_response._: Refreshing state... [id=agir-x8dkp13jl9-j49k9v-OPTIONS-200]
module.api.module.cors_disable_user.aws_api_gateway_integration_response._: Refreshing state... [id=agir-x8dkp13jl9-ispxu3-OPTIONS-200]
module.identity.aws_iam_role_policy.user: Refreshing state... [id=user_role:terraform-2021030120301306670000000f]
module.identity.aws_iam_role_policy.unauth: Refreshing state... [id=unauth_role:terraform-2021030120301306640000000e]
module.identity.aws_iam_role_policy.auth: Refreshing state... [id=auth_role:terraform-20210301203013066400000010]
module.api.aws_api_gateway_deployment.deployment: Refreshing state... [id=ms1ucp]
module.content_delivery.aws_route53_record.www: Refreshing state... [id=Z01748242C117ND6G1CV1_www.tylernorlund.com_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.data.aws_iam_policy_document.lambda_policy_doc_cognito will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_policy_doc_cognito"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:AdminUpdateUserAttributes",
              + "cognito-idp:adminDisableUser",
              + "cognito-idp:adminUserGlobalSignOut",
              + "dynamodb:DeleteItem",
              + "dynamodb:GetRecords",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
              + "dynamodb:getItem",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:681647709217:table/Blog",
              + "arn:aws:dynamodb:us-east-1:681647709217:table/Blog/*",
              + "arn:aws:logs:*:*:*",
              + (known after apply),
            ]
          + sid       = "codecommitid"
        }
    }

  # module.api.aws_api_gateway_authorizer.authorizer will be created
  + resource "aws_api_gateway_authorizer" "authorizer" {
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "CognitoUserPoolAuthorizer"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = "x8dkp13jl9"
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.api.aws_api_gateway_deployment.deployment must be replaced
-/+ resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2021-03-01T20:29:41Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:681647709217:x8dkp13jl9/prod" -> (known after apply)
      ~ id            = "ms1ucp" -> (known after apply)
      ~ invoke_url    = "https://x8dkp13jl9.execute-api.us-east-1.amazonaws.com/prod" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "42ee514eb6ef37da30e1b852990d63932719cada" -> "ac8e6d582b349ae579b34d9b202ca1155655f3e6"
        }
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_iam_role_policy.lambda_policy_cognito will be created
  + resource "aws_iam_role_policy" "lambda_policy_cognito" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = "api_blog_cognito_prod"
    }

  # module.identity.data.aws_iam_policy_document.post_confirmation will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "post_confirmation"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:AdminAddUserToGroup",
              + "cognito-idp:CreateGroup",
              + "cognito-idp:GetGroup",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:681647709217:table/Blog",
              + "arn:aws:logs:*",
              + (known after apply),
            ]
          + sid       = "codecommitid"
        }
    }

  # module.identity.aws_cognito_identity_pool.main will be created
  + resource "aws_cognito_identity_pool" "main" {
      + allow_unauthenticated_identities = true
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "blog_identity_pool_prod"

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = true
        }
    }

  # module.identity.aws_cognito_identity_pool_roles_attachment.main will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "main" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = {
          + "authenticated"   = "arn:aws:iam::681647709217:role/auth_role"
          + "unauthenticated" = "arn:aws:iam::681647709217:role/unauth_role"
        }
    }

  # module.identity.aws_cognito_user_group.Admin will be created
  + resource "aws_cognito_user_group" "Admin" {
      + description  = "Administrators that can modify the backend"
      + id           = (known after apply)
      + name         = "Admin"
      + precedence   = 1
      + role_arn     = "arn:aws:iam::681647709217:role/user_role"
      + user_pool_id = (known after apply)
    }

  # module.identity.aws_cognito_user_group.User will be created
  + resource "aws_cognito_user_group" "User" {
      + description  = "Users that have signed up and verified their emails"
      + id           = (known after apply)
      + name         = "User"
      + precedence   = 2
      + role_arn     = "arn:aws:iam::681647709217:role/user_role"
      + user_pool_id = (known after apply)
    }

  # module.identity.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "blog_user_pool_prod"
      + sms_verification_message   = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + email_configuration {
          + email_sending_account  = "DEVELOPER"
          + reply_to_email_address = "no-reply@tylernorlund.com"
          + source_arn             = "arn:aws:ses:us-east-1:681647709217:identity/no-reply@tylernorlund.com"
        }

      + lambda_config {
          + custom_message    = "arn:aws:lambda:us-east-1:681647709217:function:custom_message"
          + post_confirmation = "arn:aws:lambda:us-east-1:681647709217:function:post_confirmation"
        }

      + password_policy {
          + minimum_length    = 8
          + require_lowercase = true
          + require_numbers   = true
          + require_symbols   = true
          + require_uppercase = true
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "email"
          + required            = true
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "name"
          + required            = true
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.identity.aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + client_secret                 = (sensitive value)
      + explicit_auth_flows           = [
          + "ADMIN_NO_SRP_AUTH",
        ]
      + generate_secret               = false
      + id                            = (known after apply)
      + name                          = "client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + user_pool_id                  = (known after apply)
    }

  # module.identity.aws_iam_role_policy.post_confirmation will be created
  + resource "aws_iam_role_policy" "post_confirmation" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = "post_confirmation_prod"
    }

  # module.identity.aws_lambda_permission.custom_message will be created
  + resource "aws_lambda_permission" "custom_message" {
      + action        = "lambda:InvokeFunction"
      + function_name = "custom_message"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCognito"
    }

  # module.identity.aws_lambda_permission.post_confirmation will be created
  + resource "aws_lambda_permission" "post_confirmation" {
      + action        = "lambda:InvokeFunction"
      + function_name = "post_confirmation"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCognito"
    }

Plan: 12 to add, 0 to change, 1 to destroy.
```
</details>
*Pusher: @tnorlund, Action: `pull_request`*